{"keras_version": "1.2.0", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["prob1", 0, 0], ["prob2", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "input_dtype": "float32", "batch_input_shape": [null, 3, 112, 112], "sparse": false}}, {"name": "conv1/7x7", "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D", "config": {"b_regularizer": null, "subsample": [1, 1], "nb_row": 7, "dim_ordering": "th", "activity_regularizer": null, "nb_col": 7, "nb_filter": 96, "b_constraint": null, "border_mode": "valid", "W_constraint": null, "trainable": true, "bias": true, "name": "conv1/7x7", "activation": "relu", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "init": "glorot_uniform"}}, {"name": "pool1/2x2", "inbound_nodes": [[["conv1/7x7", 0, 0]]], "class_name": "MaxPooling2D", "config": {"name": "pool1/2x2", "strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th"}}, {"name": "norm1", "inbound_nodes": [[["pool1/2x2", 0, 0]]], "class_name": "LRN", "config": {"alpha": 0.0001, "trainable": true, "name": "norm1", "n": 5, "beta": 0.75, "k": 1}}, {"name": "conv2/5x5", "inbound_nodes": [[["norm1", 0, 0]]], "class_name": "Convolution2D", "config": {"b_regularizer": null, "subsample": [1, 1], "nb_row": 5, "dim_ordering": "th", "activity_regularizer": null, "nb_col": 5, "nb_filter": 256, "b_constraint": null, "border_mode": "same", "W_constraint": null, "trainable": true, "bias": true, "name": "conv2/5x5", "activation": "relu", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "init": "glorot_uniform"}}, {"name": "pool2/2x2", "inbound_nodes": [[["conv2/5x5", 0, 0]]], "class_name": "MaxPooling2D", "config": {"name": "pool2/2x2", "strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th"}}, {"name": "norm2", "inbound_nodes": [[["pool2/2x2", 0, 0]]], "class_name": "LRN", "config": {"alpha": 0.0001, "trainable": true, "name": "norm2", "n": 5, "beta": 0.75, "k": 1}}, {"name": "conv3/3x3", "inbound_nodes": [[["norm2", 0, 0]]], "class_name": "Convolution2D", "config": {"b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "nb_filter": 384, "b_constraint": null, "border_mode": "same", "W_constraint": null, "trainable": true, "bias": true, "name": "conv3/3x3", "activation": "relu", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "init": "glorot_uniform"}}, {"name": "pool3/2x2", "inbound_nodes": [[["conv3/3x3", 0, 0]]], "class_name": "MaxPooling2D", "config": {"name": "pool3/2x2", "strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th"}}, {"name": "flatten", "inbound_nodes": [[["pool3/2x2", 0, 0]]], "class_name": "Flatten", "config": {"name": "flatten", "trainable": true}}, {"name": "loss1/fc6", "inbound_nodes": [[["flatten", 0, 0]]], "class_name": "Dense", "config": {"output_dim": 512, "b_regularizer": null, "input_dim": 64896, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "bias": true, "name": "loss1/fc6", "activation": "relu", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "init": "glorot_uniform"}}, {"name": "loss2/fc6", "inbound_nodes": [[["flatten", 0, 0]]], "class_name": "Dense", "config": {"output_dim": 512, "b_regularizer": null, "input_dim": 64896, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "bias": true, "name": "loss2/fc6", "activation": "relu", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "init": "glorot_uniform"}}, {"name": "loss1/drop/fc6", "inbound_nodes": [[["loss1/fc6", 0, 0]]], "class_name": "Dropout", "config": {"name": "loss1/drop/fc6", "p": 0.4, "trainable": true}}, {"name": "loss2/drop/fc6", "inbound_nodes": [[["loss2/fc6", 0, 0]]], "class_name": "Dropout", "config": {"name": "loss2/drop/fc6", "p": 0.4, "trainable": true}}, {"name": "loss1/fc7", "inbound_nodes": [[["loss1/drop/fc6", 0, 0]]], "class_name": "Dense", "config": {"output_dim": 512, "b_regularizer": null, "input_dim": 512, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "bias": true, "name": "loss1/fc7", "activation": "relu", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "init": "glorot_uniform"}}, {"name": "loss2/fc7", "inbound_nodes": [[["loss2/drop/fc6", 0, 0]]], "class_name": "Dense", "config": {"output_dim": 512, "b_regularizer": null, "input_dim": 512, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "bias": true, "name": "loss2/fc7", "activation": "relu", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "init": "glorot_uniform"}}, {"name": "loss1/drop/fc7", "inbound_nodes": [[["loss1/fc7", 0, 0]]], "class_name": "Dropout", "config": {"name": "loss1/drop/fc7", "p": 0.4, "trainable": true}}, {"name": "loss2/drop/fc7", "inbound_nodes": [[["loss2/fc7", 0, 0]]], "class_name": "Dropout", "config": {"name": "loss2/drop/fc7", "p": 0.4, "trainable": true}}, {"name": "prob1", "inbound_nodes": [[["loss1/drop/fc7", 0, 0]]], "class_name": "Dense", "config": {"output_dim": 10, "b_regularizer": null, "input_dim": 512, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "bias": true, "name": "prob1", "activation": "relu", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "init": "glorot_uniform"}}, {"name": "prob2", "inbound_nodes": [[["loss2/drop/fc7", 0, 0]]], "class_name": "Dense", "config": {"output_dim": 2, "b_regularizer": null, "input_dim": 512, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "bias": true, "name": "prob2", "activation": "relu", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "init": "glorot_uniform"}}]}}