{"keras_version": "1.2.0", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["prob1", 0, 0], ["prob2", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 3, 112, 112], "input_dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv1/7x7", "config": {"border_mode": "valid", "trainable": true, "name": "conv1/7x7", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "nb_filter": 96, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 7, "dim_ordering": "th", "W_constraint": null, "nb_row": 7, "b_constraint": null}, "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D"}, {"name": "pool1/2x2", "config": {"border_mode": "valid", "trainable": true, "name": "pool1/2x2", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "th"}, "inbound_nodes": [[["conv1/7x7", 0, 0]]], "class_name": "MaxPooling2D"}, {"name": "norm1", "config": {"trainable": true, "alpha": 0.0001, "beta": 0.75, "name": "norm1", "n": 5, "k": 1}, "inbound_nodes": [[["pool1/2x2", 0, 0]]], "class_name": "LRN"}, {"name": "conv2/5x5", "config": {"border_mode": "same", "trainable": true, "name": "conv2/5x5", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "nb_filter": 256, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 5, "dim_ordering": "th", "W_constraint": null, "nb_row": 5, "b_constraint": null}, "inbound_nodes": [[["norm1", 0, 0]]], "class_name": "Convolution2D"}, {"name": "pool2/2x2", "config": {"border_mode": "valid", "trainable": true, "name": "pool2/2x2", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "th"}, "inbound_nodes": [[["conv2/5x5", 0, 0]]], "class_name": "MaxPooling2D"}, {"name": "norm2", "config": {"trainable": true, "alpha": 0.0001, "beta": 0.75, "name": "norm2", "n": 5, "k": 1}, "inbound_nodes": [[["pool2/2x2", 0, 0]]], "class_name": "LRN"}, {"name": "conv3/3x3", "config": {"border_mode": "same", "trainable": true, "name": "conv3/3x3", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "nb_filter": 384, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "nb_row": 3, "b_constraint": null}, "inbound_nodes": [[["norm2", 0, 0]]], "class_name": "Convolution2D"}, {"name": "pool3/2x2", "config": {"border_mode": "valid", "trainable": true, "name": "pool3/2x2", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "th"}, "inbound_nodes": [[["conv3/3x3", 0, 0]]], "class_name": "MaxPooling2D"}, {"name": "flatten", "config": {"name": "flatten", "trainable": true}, "inbound_nodes": [[["pool3/2x2", 0, 0]]], "class_name": "Flatten"}, {"name": "loss1/fc6", "config": {"activation": "relu", "trainable": true, "name": "loss1/fc6", "output_dim": 512, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "input_dim": 64896, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "bias": true, "W_constraint": null, "b_constraint": null}, "inbound_nodes": [[["flatten", 0, 0]]], "class_name": "Dense"}, {"name": "loss2/fc6", "config": {"activation": "relu", "trainable": true, "name": "loss2/fc6", "output_dim": 512, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "input_dim": 64896, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "bias": true, "W_constraint": null, "b_constraint": null}, "inbound_nodes": [[["flatten", 0, 0]]], "class_name": "Dense"}, {"name": "loss1/drop/fc6", "config": {"name": "loss1/drop/fc6", "p": 0.4, "trainable": true}, "inbound_nodes": [[["loss1/fc6", 0, 0]]], "class_name": "Dropout"}, {"name": "loss2/drop/fc6", "config": {"name": "loss2/drop/fc6", "p": 0.4, "trainable": true}, "inbound_nodes": [[["loss2/fc6", 0, 0]]], "class_name": "Dropout"}, {"name": "loss1/fc7", "config": {"activation": "relu", "trainable": true, "name": "loss1/fc7", "output_dim": 512, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "input_dim": 512, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "bias": true, "W_constraint": null, "b_constraint": null}, "inbound_nodes": [[["loss1/drop/fc6", 0, 0]]], "class_name": "Dense"}, {"name": "loss2/fc7", "config": {"activation": "relu", "trainable": true, "name": "loss2/fc7", "output_dim": 512, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "input_dim": 512, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "bias": true, "W_constraint": null, "b_constraint": null}, "inbound_nodes": [[["loss2/drop/fc6", 0, 0]]], "class_name": "Dense"}, {"name": "loss1/drop/fc7", "config": {"name": "loss1/drop/fc7", "p": 0.4, "trainable": true}, "inbound_nodes": [[["loss1/fc7", 0, 0]]], "class_name": "Dropout"}, {"name": "loss2/drop/fc7", "config": {"name": "loss2/drop/fc7", "p": 0.4, "trainable": true}, "inbound_nodes": [[["loss2/fc7", 0, 0]]], "class_name": "Dropout"}, {"name": "prob1", "config": {"activation": "relu", "trainable": true, "name": "prob1", "output_dim": 10, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "input_dim": 512, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "bias": true, "W_constraint": null, "b_constraint": null}, "inbound_nodes": [[["loss1/drop/fc7", 0, 0]]], "class_name": "Dense"}, {"name": "prob2", "config": {"activation": "relu", "trainable": true, "name": "prob2", "output_dim": 2, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "input_dim": 512, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.00019999999494757503}, "bias": true, "W_constraint": null, "b_constraint": null}, "inbound_nodes": [[["loss2/drop/fc7", 0, 0]]], "class_name": "Dense"}]}, "class_name": "Model"}